developer_examples = [
    {
        "input": "데이터베이스",
        "answer":
            """
                실시간 주문과 재고 관리가 중요한 대규모 전자상거래 웹 애플리케이션을 개발하고 있습니다 단일 데이터베이스 서버만 운영하면서 모든 주문, 결제, 재고 업데이트 작업을 처리할 때 어떤 문제가 발생할 있는지 말해보세요
            """
    },
    {
        "input": "인덱스",
        "answer":
            """
                수백만 건의 데이터를 보유한 주문 테이블을 운영 중이다. 이 테이블에는 주문번호, 사용자 ID, 주문 생성일 등 다양한 컬럼이 존재하며, 최근 사용자 주문 이력을 날짜 범위로 조회하는 쿼리의 성능이 크게 저하된 것을 발견했다. 어떻게 해결할 것인가
            """
    },
    {
        "input": "CPU 스케줄링",
        "answer":
            """
                운영체제 내에서 여러 프로세스에 CPU를 할당하는 스케줄러를 설계 중입니다. 이 시스템에는 CPU를 장시간 사용하는 CPU-bound 작업과, 빠른 응답성을 요구하며, I/O 작업에 집중하는 I/O-bound 작업이 동시에 존재한다 할때 어떤 알고리즘을 사용하겠는가?
            """
    },
]